Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
TGM (InputLayer)             [(None, 3)]               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                128       
_________________________________________________________________
dense_2 (Dense)              (None, 128)               4224      
_________________________________________________________________
dense_3 (Dense)              (None, 512)               66048     
_________________________________________________________________
dense_4 (Dense)              (None, 1024)              525312    
_________________________________________________________________
predicted_spectrum (Dense)   (None, 2099)              2151475   
=================================================================
Total params: 2,747,187
Trainable params: 2,747,187
Non-trainable params: 0
_________________________________________________________________
