Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
TGM (InputLayer)             [(None, 3)]               0         
_________________________________________________________________
dense_1 (Dense)              (None, 32)                128       
_________________________________________________________________
dense_2 (Dense)              (None, 64)                2112      
_________________________________________________________________
predicted_spectrum (Dense)   (None, 2099)              136435    
=================================================================
Total params: 138,675
Trainable params: 138,675
Non-trainable params: 0
_________________________________________________________________
