Model: "model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
TGM (InputLayer)             [(None, 3)]               0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                256       
_________________________________________________________________
dense_2 (Dense)              (None, 256)               16640     
_________________________________________________________________
dense_3 (Dense)              (None, 1024)              263168    
_________________________________________________________________
predicted_spectrum (Dense)   (None, 2099)              2151475   
=================================================================
Total params: 2,431,539
Trainable params: 2,431,539
Non-trainable params: 0
_________________________________________________________________
